Revit 2024 API
PathOfTravel.GetWaypoints Method
 return the waypoints set for the Path of Travel
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.2
Syntax
C#
public IList<XYZ> GetWaypoints()
Visual Basic
Public Function GetWaypoints As IList(Of XYZ)
Visual C++
public:
IList<XYZ^>^ GetWaypoints()
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace